andrew-2.3.1/run/tutorials/combustion/fireFoam/les/flameSpreadWaterSuppressionPanel/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel    infinitelyFastChemistry<psiThermoCombustion,gasHThermoPhysics>;

active  true;

infinitelyFastChemistryCoeffs
{
    semiImplicit    no;
    C               10;
}
