andrew-2.3.1/run/tutorials/combustion/fireFoam/les/flameSpreadWaterSuppressionPanel/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    f0;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.1 -2.1 -0.1)(0.201 2.51 0.01);
        }
    }


    {
        name    coupledWall;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name   coupledWallTmp;
        }
    }

    {
        name    coupledWall;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet   coupledWall;
        }
    }
);

// ************************************************************************* //
